#language: ru

  Функционал: Яндекс Маркет

    Сценарий: Выбор телевизора

      Когда выбран пункт меню "Маркет"
      И пользователь находится на странице Яндекс Маркета
      Тогда выбран город

      Когда выбран раздел в Маркете "Электроника" "Телевизоры"
      Тогда выбрано количество элементов товара 12

      Когда выбрано отображение в виде списка
      И произведен переход в расширенный поиск
      Тогда указана минимальная цена "20000"

      Когда выбран производитель "Samsung"
      И выбран производитель "LG"
      И нажата кнопка Показать подходящие
      Тогда проверено количество выводимых результатов


    Сценарий: Выбор наушников

      Когда выбран пункт меню "Маркет"
      И пользователь находится на странице Яндекс Маркета
      Тогда выбран город

      Когда выбран раздел в Маркете "Электроника" "Наушники"
      Тогда выбрано количество элементов товара 12

      Когда выбрано отображение в виде списка
      И произведен переход в расширенный поиск
      Тогда указана минимальная цена "5000"

      Когда выбран производитель "Beats"
      И нажата кнопка Показать подходящие
      Тогда проверено количество выводимых результатов

      Когда найден первый товар
      Тогда проверена работа поиска

